app/Controllers/Artikel.php

    public function admin_index()
    {
        $title       = 'Daftar Artikel';
        $model       = new ArtikelModel();
        $q           = $this->request->getVar('q') ?? '';
        $kategori_id = $this->request->getVar('kategori_id') ?? '';
        $page        = $this->request->getVar('page') ?? 1;

        // Sorting
        $sort        = $this->request->getVar('sort')  ?? 'artikel.id';
        $order       = $this->request->getVar('order') ?? 'asc';
        $allowedSort = ['artikel.id', 'artikel.judul', 'kategori.nama_kategori', 'artikel.status'];
        if (!in_array($sort, $allowedSort)) $sort = 'artikel.id';
        $order = ($order === 'desc') ? 'desc' : 'asc';

        $artikel = $model->select('artikel.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left');

        if ($q != '') {
            $artikel->like('artikel.judul', $q);
        }
        if ($kategori_id != '') {
            $artikel->where('artikel.id_kategori', $kategori_id);
        }

        $artikelData = $artikel->orderBy($sort, $order)->paginate(10, 'default', $page);
---
SELECT COUNT(*) AS `numrows`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
ORDER BY `kategori`.`nama_kategori` ASC
 LIMIT 10

        }

        $kategoriModel    = new KategoriModel();
        $data['kategori'] = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`