app/Controllers/Post.php

    public function create()
    {
        $model = new ArtikelModel();
        $data  = [
            'judul' => $this->request->getVar('judul'),
            'isi'   => $this->request->getVar('isi'),
            'slug'  => url_title($this->request->getVar('judul'), '-', true),
        ];
        $model->insert($data);
---
INSERT INTO `artikel` (`judul`, `isi`, `slug`) VALUES (' Pentingnya Tidur Cukup untuk Kesehatan Mental dan Fisik', 'Kurang tidur sering dianggap sepele, padahal kebiasaan ini berdampak besar pada kesehatan kita. Kurang tidur dapat menurunkan daya tahan tubuh, mengurangi fokus, dan memicu stres. Sebaliknya, tidur cukup selama 7-8 jam setiap malam membantu tubuh memperbaiki jaringan sel, menjaga kestabilan emosi, dan mengembalikan energi agar tubuh lebih produktif di keesokan harinya.', 'pentingnya-tidur-cukup-untuk-kesehatan-mental-dan-fisik')

    public function delete($id = null)
    {
        $model = new ArtikelModel();
        $data  = $model->where('id', $id)->first();
        if ($data) {
            $model->delete($id);
---
SELECT *
FROM `artikel`
WHERE `id` = '7'
 LIMIT 1
DELETE FROM `artikel`
WHERE `id` IN ('7')